cf_billing/InformationRegisters/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСостояниеПриборовУчетаАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСостояниеПриборовУчетаАбонента</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргУслугиТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргУслугиТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Техническая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНаправлениеИспользованияТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНаправлениеИспользованияТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПоставщикиУслугАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПоставщикиУслугАбонента</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьСоставной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргВидыДифференцированностиПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргВидыДифференцированностиПриборовУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДифференцированности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шкала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргРасчетныеСпособыТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргРасчетныеСпособыТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РасчетныйСпособ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименятьФормулуВсегда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСоставУзлаУчетаПомещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСоставУзлаУчетаПомещения</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Измеритель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/CommonModules/энргСостояниеПриборовУчета/Ext/Module.bsl
#Область ПрограмныйИнтерфейс

Функция ДействующиеПриборыУчетаПомещения(Период, Организация, Район, КлючПомещения, ТочкаУчета = Неопределено, ВключаяОРП = Ложь, ПараметрыОтбора = Неопределено) Экспорт 
	
	Схема 			= Неопределено;  	
	ПараметрыВТ 	= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация"	, "Организация"), Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район"		, "Район")		, Неопределено));
	
	Если ТипЗнч(КлючПомещения) = Тип("Массив") Тогда
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("КлючПомещения", "КлючПомещения")));
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("АбонентВладелец", "КлючПомещения")));
	Иначе
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("КлючПомещения", "КлючПомещения")));
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("АбонентВладелец", "КлючПомещения")));
	КонецЕсли;
		
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("ТочкаУчета", 	"ТочкаУчета"), 		Неопределено));
	КонецЕсли;
		
	Если ПараметрыОтбора = Неопределено Тогда
		Параметры 		= Новый Структура;	
	Иначе
		Параметры		= ПараметрыОтбора;
	КонецЕсли;	
	Параметры.Вставить("ПараметрыВТ", 		ПараметрыВТ);
	Если ЗначениеЗаполнено(Период) Тогда
		Параметры.Вставить("Период",  Новый Структура("ИмяПараметра,ТипПараметра", "Период", "ГраницаИсключая"));
	КонецЕсли;

	Если ВключаяОРП Тогда 
		Параметры.Вставить("ВключаяОРП", Истина);
	КонецЕсли;
	
	ЗаполнитьСхемуЗапросаДействующихПриборовУчетаПомещения(Схема, Параметры);
	ПараметрыЗапроса 	= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация",		Организация);
	ПараметрыЗапроса.Вставить("Район",				Район); 	
	ПараметрыЗапроса.Вставить("КлючПомещения",		КлючПомещения);
	Если ТипЗнч(Период) = Тип("Граница") Тогда
		ПараметрыЗапроса.Вставить("Период",			Период);
	Иначе
		ПараметрыЗапроса.Вставить("Период",			Период);
	КонецЕсли;
	
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыЗапроса.Вставить("ТочкаУчета",		ТочкаУчета);
	КонецЕсли;	
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса); 
			
КонецФункции

Функция ДействующийСоставУзлаПомещения(Период,Организация,Район,КлючПомещения, ТочкаУчета = Неопределено, ВключаяОРП = Ложь) Экспорт 
	
	Схема 								= Неопределено;  	
	ПараметрыВТ 						= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация", 	"Организация"), 	Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район", 			"Район"), 			Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("КлючПомещения", 	"КлючПомещения"), 	Неопределено));
		
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("ТочкаУчета", 	"ТочкаУчета"), 		Неопределено));
	КонецЕсли;
	
	Параметры 	= Новый Структура;	
	Параметры.Вставить("ПараметрыВТ", 		ПараметрыВТ);
	Если ЗначениеЗаполнено(Период) Тогда
		Параметры.Вставить("Период",  Новый Структура("ИмяПараметра,ТипПараметра", "Период", "ГраницаИсключая"));
	КонецЕсли;
	
	Если ВключаяОРП Тогда 
		Параметры.Вставить("ВключаяОРП", Истина);
	КонецЕсли;
	
	ЗаполнитьСхемуДействующийСоставУзлаПомещения(Схема, Параметры);
	
	ПараметрыЗапроса 					= Новый Структура;
	ПараметрыЗапроса.Вставить("Период",					Период);
	ПараметрыЗапроса.Вставить("Организация",			Организация);
	ПараметрыЗапроса.Вставить("Район",					Район); 	
	ПараметрыЗапроса.Вставить("КлючПомещения",			КлючПомещения);
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыЗапроса.Вставить("ТочкаУчета",			ТочкаУчета);
	КонецЕсли;
	
	РезультатЗапроса 				= энргСхемаЗапросаСервер.ВыполнитьПакет(Схема, ПараметрыЗапроса);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргСостояниеПриборовУчета.ДействующийСоставУзлаПомещения";
		ПараметрыМетода 			= Новый Структура("Период,Организация,Район,КлючПомещения,ТочкаУчета",Период,Организация,Район,КлючПомещения,ТочкаУчета); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, РезультатЗапроса, ПараметрыМетода);
	КонецЕсли;
	
	Возврат РезультатЗапроса;	
КонецФункции

Функция ДействующиеПриборыУчетаПоМаршруту(Период, Организация, Район, МаршрутКонтроллера, Строение = Неопределено, ВключаяОРП = Ложь) Экспорт 
	
	Схема 							= Новый СхемаЗапроса;
	
	Если Строение = Неопределено Тогда
		Справочники.энргМаршрутыКонтроллеров.СоставМаршрута(Схема,"Адреса");	
		Справочники.энргКлючиПомещений.КлючиПомещенийПоПредставлениюАдресов(Схема,"КлючиПомещений");
	Иначе 
		ОтборКлючейПомещений 		= Новый Массив;
		ОтборКлючейПомещений.Добавить(Новый Структура("ИмяПараметра,ТипПараметра,СоотвествиеПолей","","ТипПараметраРавно",Новый Структура("Строение","Строение")));
		
		ПараметрыКлючПомещений 		= Новый Структура("ПараметрыВТ", ОтборКлючейПомещений);
		РегистрыСведений.энргКлючиПомещений.ДанныеПомещения(Схема, ПараметрыКлючПомещений, "КлючиПомещений");
	КонецЕсли;
	
	Параметры 						= Новый Структура;	
	Параметры.Вставить("Период", Новый Структура("ИмяПараметра","Период"));
	Если ВключаяОРП Тогда 
		Параметры.Вставить("ВключаяОРП", Истина);
	КонецЕсли;
	
	
	ПараметрыВТ 					= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ИмяПараметра,ТипПараметра,СоотвествиеПолей", 					"", 			"ТипПараметраРавно",			Новый Структура("Организация,Район","Организация","Район")));
	ПараметрыВТ.Добавить(Новый Структура("ИмяПараметра,ТаблицаИсточник,ТипПараметра,СоотвествиеПолей", "КлючиПомещений", "КлючиПомещений", "ТипПараметраВременнаяТаблица",	Новый Структура("КлючПомещения","КлючПомещения")));
		
	Параметры.Вставить("ПараметрыВТ",	ПараметрыВТ);
	ЗаполнитьСхемуЗапросаДействующихПриборовУчетаПомещения(Схема, Параметры);
	
	ПараметрыЗапроса  				= Новый Структура;
	ПараметрыЗапроса.Вставить("Период",					Период);//Новый Граница(Период,ВидГраницы.Исключая));
	ПараметрыЗапроса.Вставить("Район",					Район);
	ПараметрыЗапроса.Вставить("Организация",			Организация);
	ПараметрыЗапроса.Вставить("МаршрутКонтроллера",		МаршрутКонтроллера);
	Если НЕ Строение = Неопределено Тогда
		ПараметрыЗапроса.Вставить("Строение",			Строение);
	КонецЕсли; 	
	
	РезультатЗапроса 				= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "энргСостояниеПриборовУчета.ДействующиеПриборыУчетаПоМаршруту";
		ПараметрыМетода 			= Новый Структура("Период, Организация, Район, МаршрутКонтроллера,Строение",Период, Организация, Район, МаршрутКонтроллера,Строение); 
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, РезультатЗапроса, ПараметрыМетода);
	КонецЕсли;
	
	Возврат РезультатЗапроса
	
КонецФункции

Функция АктивныеПриборыУчета(Период, Организация, Район, КлючПомещения, ТочкаУчета = Неопределено, ВключаяОРП = Ложь, ПараметрыОтбора = Неопределено) Экспорт
	
	Схема 			= Неопределено;  	
	ПараметрыВТ 	= Новый Массив;
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Организация"	, "Организация"), Неопределено));
	ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("Район"		, "Район")		, Неопределено));
	
	Если ТипЗнч(КлючПомещения) = Тип("Массив") Тогда
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("КлючПомещения", "КлючПомещения")));
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипВСписке(Новый Структура("АбонентВладелец", "КлючПомещения")));
	Иначе
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("КлючПомещения", "КлючПомещения")));
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("АбонентВладелец", "КлючПомещения")));
	КонецЕсли;
		
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыВТ.Добавить(Новый Структура("ТипПараметра, СоотвествиеПолей, ТаблицаИсточник", "ТипПараметраРавно", Новый Структура("ТочкаУчета", 	"ТочкаУчета"), 		Неопределено));
	КонецЕсли;
		
	Если ПараметрыОтбора = Неопределено Тогда
		Параметры = Новый Структура;	
	Иначе
		Параметры = ПараметрыОтбора;
	КонецЕсли;	
	Параметры.Вставить("ПараметрыВТ", ПараметрыВТ);
	Если ЗначениеЗаполнено(Период) Тогда
		Параметры.Вставить("Период",  Новый Структура("ИмяПараметра,ТипПараметра", "Период", "ГраницаИсключая"));
	КонецЕсли;

	Если ВключаяОРП Тогда 
		Параметры.Вставить("ВключаяОРП", Истина);
	КонецЕсли;
	
	РегистрыСведений.энргСостояниеПриборовУчетаАбонента.ДействующиеПриборыУчетаПомещения(Схема, Параметры);
	
	ПараметрыЗапроса 	= Новый Структура;
	ПараметрыЗапроса.Вставить("Организация",		Организация);
	ПараметрыЗапроса.Вставить("Район",				Район); 	
	ПараметрыЗапроса.Вставить("КлючПомещения",		КлючПомещения);
	Если ТипЗнч(Период) = Тип("Граница") Тогда
		ПараметрыЗапроса.Вставить("Период",			Период);
	Иначе
		ПараметрыЗапроса.Вставить("Период",			Период);
	КонецЕсли;
	
	Если НЕ ТочкаУчета = Неопределено Тогда
		ПараметрыЗапроса.Вставить("ТочкаУчета",		ТочкаУчета);
	КонецЕсли;	
	
	Возврат энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема, ПараметрыЗапроса);
	
КонецФункции 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьСхемуЗапросаДействующихПриборовУчетаПомещения(Схема, Параметры) Экспорт 
	
	ЗаполнитьСхемуЗапросаДействующегоОсновногоОборудованияПомещения(Схема, Параметры);
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ВидКанальности КАК ВидКанальности,
	|	ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|	энргВидыКанальностиШкалы.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ЗаводскойНомерПриборУчета КАК ЗаводскойНомерПриборУчета
	|ПОМЕСТИТЬ ДанныеПоПриборам
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДействующиеПриборыУчетаПомещения.Организация КАК Организация,
	|		ДействующиеПриборыУчетаПомещения.Район КАК Район,
	|		ДействующиеПриборыУчетаПомещения.КлючПомещения КАК КлючПомещения,
	|		ДействующиеПриборыУчетаПомещения.ТочкаУчета КАК ТочкаУчета,
	|		ДействующиеПриборыУчетаПомещения.ПриборУчета КАК ПриборУчета,
	|		энргПриборыУчетаАбонента.ВидКанальности КАК ВидКанальности,
	|		энргПриборыУчетаАбонента.РегистрируетОбъем КАК РегистрируетОбъем,
	|		энргПриборыУчетаАбонента.Код КАК ЗаводскойНомерПриборУчета
	|	ИЗ
	|		ДействующиеПриборыУчетаПомещения КАК ДействующиеПриборыУчетаПомещения
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|			ПО ДействующиеПриборыУчетаПомещения.ПриборУчета = энргПриборыУчетаАбонента.Ссылка) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
	|		ПО ВложенныйЗапрос.ВидКанальности = энргВидыКанальностиШкалы.Ссылка");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|	ВложенныйЗапрос.ВидДифференцированности КАК ВидДифференцированности,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ВложенныйЗапрос.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.ЗаводскойНомерПриборУчета КАК ЗаводскойНомерПриборУчета,
	|	ЕСТЬNULL(ДатыПоверкиВведенныхПриборовДействующихТочек.ДатаПоверки, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПоверки,
	|	ЕСТЬNULL(ПоставщикиУслугДействующихТочек.Поставщик, ЗНАЧЕНИЕ(Справочник.энргКонтрагенты.ПустаяСсылка)) КАК Поставщик
	|ИЗ
	|	(ВЫБРАТЬ
	|		Вложенныйзапрос.Организация КАК Организация,
	|		Вложенныйзапрос.Район КАК Район,
	|		Вложенныйзапрос.КлючПомещения КАК КлючПомещения,
	|		АбонентыПомещений.Абонент КАК Абонент,
	|		Вложенныйзапрос.ТочкаУчета КАК ТочкаУчета,
	|		Вложенныйзапрос.ПриборУчета КАК ПриборУчета,
	|		Вложенныйзапрос.Шкала КАК Шкала,
	|		Вложенныйзапрос.Услуга КАК Услуга,
	|		Вложенныйзапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|		Вложенныйзапрос.ВидДифференцированности КАК ВидДифференцированности,
	|		Вложенныйзапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		Вложенныйзапрос.РасчетПоФормуле КАК РасчетПоФормуле,
	|		ЕСТЬNULL(энргВидыУслуг.СоставнаяУслуга, ЛОЖЬ) КАК СоставнаяУслуга,
	|		Вложенныйзапрос.ЗаводскойНомерПриборУчета КАК ЗаводскойНомерПриборУчета
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ДанныеПоПриборам.Организация КАК Организация,
	|			ДанныеПоПриборам.Район КАК Район,
	|			ДанныеПоПриборам.КлючПомещения КАК КлючПомещения,
	|			ДанныеПоПриборам.ТочкаУчета КАК ТочкаУчета,
	|			ДанныеПоПриборам.ПриборУчета КАК ПриборУчета,
	|			ДанныеПоПриборам.ЗаводскойНомерПриборУчета КАК ЗаводскойНомерПриборУчета,
	|			ДанныеПоПриборам.Шкала КАК Шкала,
	|			ДанныеПоПриборам.РегистрируетОбъем КАК РегистрируетОбъем,
	|			ЕСТЬNULL(УслугиДействующихТочек.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга,
	|			ЕСТЬNULL(НаправлениеИспользованияДействующихТочек.НаправлениеИспользованияТУ, ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК НаправлениеИспользованияТУ,
	|			НЕ ДействующиеТочкиТочкиПоФормуле.ТочкаУчета ЕСТЬ NULL КАК РасчетПоФормуле,
	|			ЕСТЬNULL(ВидДифференцированностиВведенныхПриборов.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)) КАК ВидДифференцированности
	|		ИЗ
	|			ДанныеПоПриборам КАК ДанныеПоПриборам
	|				ЛЕВОЕ СОЕДИНЕНИЕ УслугиДействующихТочек КАК УслугиДействующихТочек
	|				ПО ДанныеПоПриборам.Организация = УслугиДействующихТочек.Организация
	|					И ДанныеПоПриборам.Район = УслугиДействующихТочек.Район
	|					И ДанныеПоПриборам.КлючПомещения = УслугиДействующихТочек.КлючПомещения
	|					И ДанныеПоПриборам.ТочкаУчета = УслугиДействующихТочек.ТочкаУчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ НаправлениеИспользованияДействующихТочек КАК НаправлениеИспользованияДействующихТочек
	|				ПО ДанныеПоПриборам.Организация = НаправлениеИспользованияДействующихТочек.Организация
	|					И ДанныеПоПриборам.Район = НаправлениеИспользованияДействующихТочек.Район
	|					И ДанныеПоПриборам.КлючПомещения = НаправлениеИспользованияДействующихТочек.КлючПомещения
	|					И ДанныеПоПриборам.ТочкаУчета = НаправлениеИспользованияДействующихТочек.ТочкаУчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеТочкиТочкиПоФормуле КАК ДействующиеТочкиТочкиПоФормуле
	|				ПО ДанныеПоПриборам.Организация = ДействующиеТочкиТочкиПоФормуле.Организация
	|					И ДанныеПоПриборам.Район = ДействующиеТочкиТочкиПоФормуле.Район
	|					И ДанныеПоПриборам.КлючПомещения = ДействующиеТочкиТочкиПоФормуле.КлючПомещения
	|					И ДанныеПоПриборам.ТочкаУчета = ДействующиеТочкиТочкиПоФормуле.ТочкаУчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВидДифференцированностиВведенныхПриборов КАК ВидДифференцированностиВведенныхПриборов
	|				ПО ДанныеПоПриборам.Организация = ВидДифференцированностиВведенныхПриборов.Организация
	|					И ДанныеПоПриборам.Район = ВидДифференцированностиВведенныхПриборов.Район
	|					И ДанныеПоПриборам.КлючПомещения = ВидДифференцированностиВведенныхПриборов.КлючПомещения
	|					И ДанныеПоПриборам.ПриборУчета = ВидДифференцированностиВведенныхПриборов.ПриборУчета
	|					И ДанныеПоПриборам.Шкала = ВидДифференцированностиВведенныхПриборов.Шкала) КАК Вложенныйзапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|			ПО Вложенныйзапрос.Услуга = энргВидыУслуг.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ АбонентыПомещений КАК АбонентыПомещений
	|			ПО Вложенныйзапрос.Организация = АбонентыПомещений.Организация
	|				И Вложенныйзапрос.Район = АбонентыПомещений.Район
	|				И Вложенныйзапрос.Услуга = АбонентыПомещений.Услуга
	|				И Вложенныйзапрос.КлючПомещения = АбонентыПомещений.КлючПомещения) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|		ПО ВложенныйЗапрос.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка   
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДатыПоверкиВведенныхПриборовДействующихТочек КАК ДатыПоверкиВведенныхПриборовДействующихТочек
	|		ПО ВложенныйЗапрос.Организация = ДатыПоверкиВведенныхПриборовДействующихТочек.Организация
	|			И ВложенныйЗапрос.Район = ДатыПоверкиВведенныхПриборовДействующихТочек.Район
	|			И ВложенныйЗапрос.КлючПомещения = ДатыПоверкиВведенныхПриборовДействующихТочек.КлючПомещения
	|			И ВложенныйЗапрос.ПриборУчета = ДатыПоверкиВведенныхПриборовДействующихТочек.ПриборУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоставщикиУслугДействующихТочек КАК ПоставщикиУслугДействующихТочек
	|		ПО Вложенныйзапрос.Организация = ПоставщикиУслугДействующихТочек.Организация
	|			И Вложенныйзапрос.Район = ПоставщикиУслугДействующихТочек.Район
	|			И Вложенныйзапрос.ТочкаУчета = ПоставщикиУслугДействующихТочек.ТочкаУчета
	|			И Вложенныйзапрос.КлючПомещения = ПоставщикиУслугДействующихТочек.КлючПомещения
	|			И Вложенныйзапрос.Услуга = ПоставщикиУслугДействующихТочек.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Район,
	|	КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.Шкала");
	
КонецПроцедуры

Процедура ЗаполнитьСхемуДействующийСоставУзлаПомещения(Схема, Параметры) Экспорт 
	
	ЗаполнитьСхемуЗапросаДействующегоОсновногоОборудованияПомещения(Схема, Параметры);
	ЗаполнитьСхемуЗапросаДействующегоВспомогательногоОборудованияПомещения(Схема, Параметры);
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.ВидКанальности КАК ВидКанальности,
	|	ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|	энргВидыКанальностиШкалы.Шкала КАК Шкала,
	|	ВложенныйЗапрос.ТипУзлаУчета КАК ТипУзлаУчета,
	|	ВложенныйЗапрос.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	ВложенныйЗапрос.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ВложенныйЗапрос.ТипИзмерителя КАК ТипИзмерителя
	|ПОМЕСТИТЬ ДанныеПоПриборам
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВведенныеПриборыДействующихТочек.Организация КАК Организация,
	|		ВведенныеПриборыДействующихТочек.Район КАК Район,
	|		ВведенныеПриборыДействующихТочек.КлючПомещения КАК КлючПомещения,
	|		ВведенныеПриборыДействующихТочек.ТочкаУчета КАК ТочкаУчета,
	|		ВведенныеПриборыДействующихТочек.ПриборУчета КАК ПриборУчета,
	|		энргПриборыУчетаАбонента.ВидКанальности КАК ВидКанальности,
	|		энргПриборыУчетаАбонента.РегистрируетОбъем КАК РегистрируетОбъем,
	|		энргПриборыУчетаАбонента.ТипУзлаУчета КАК ТипУзлаУчета,
	|		энргПриборыУчетаАбонента.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|		энргПриборыУчетаАбонента.ТипПрибораУчета КАК ТипПрибораУчета,
	|		энргТипыПриборовУчета.Родитель КАК ТипИзмерителя
	|	ИЗ
	|		ДействующиеПриборыУчетаПомещения КАК ВведенныеПриборыДействующихТочек
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргТипыПриборовУчета КАК энргТипыПриборовУчета
	|				ПО энргПриборыУчетаАбонента.ТипПрибораУчета = энргТипыПриборовУчета.Ссылка
	|			ПО ВведенныеПриборыДействующихТочек.ПриборУчета = энргПриборыУчетаАбонента.Ссылка) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
	|		ПО ВложенныйЗапрос.ВидКанальности = энргВидыКанальностиШкалы.Ссылка");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Район КАК Район,
	|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
	|	ВложенныйЗапрос.Абонент КАК Абонент,
	|	ВложенныйЗапрос.ТочкаУчета КАК ТочкаУчета,
	|	ВложенныйЗапрос.ПриборУчета КАК ПриборУчета,
	|	ВложенныйЗапрос.Шкала КАК Шкала,
	|	ВложенныйЗапрос.Услуга КАК Услуга,
	|	ВложенныйЗапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|	ВложенныйЗапрос.ВидДифференцированности КАК ВидДифференцированности,
	|	ВложенныйЗапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	ВложенныйЗапрос.РасчетПоФормуле КАК РасчетПоФормуле,
	|	ВложенныйЗапрос.СоставнаяУслуга КАК СоставнаяУслуга,
	|	энргВидыДифференцированностиТарифныеЗоны.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВложенныйЗапрос.ТипУзлаУчета КАК ТипУзлаУчета,
	|	ВложенныйЗапрос.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	ВложенныйЗапрос.ТипПрибораУчета КАК ТипПрибораУчета,
	|	ВложенныйЗапрос.ТипИзмерителя КАК ТипИзмерителя
	|ИЗ
	|	(ВЫБРАТЬ
	|		Вложенныйзапрос.Организация КАК Организация,
	|		Вложенныйзапрос.Район КАК Район,
	|		Вложенныйзапрос.КлючПомещения КАК КлючПомещения,
	|		АбонентыПомещений.Абонент КАК Абонент,
	|		Вложенныйзапрос.ТочкаУчета КАК ТочкаУчета,
	|		Вложенныйзапрос.ПриборУчета КАК ПриборУчета,
	|		Вложенныйзапрос.Шкала КАК Шкала,
	|		Вложенныйзапрос.Услуга КАК Услуга,
	|		Вложенныйзапрос.РегистрируетОбъем КАК РегистрируетОбъем,
	|		Вложенныйзапрос.ВидДифференцированности КАК ВидДифференцированности,
	|		Вложенныйзапрос.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		Вложенныйзапрос.РасчетПоФормуле КАК РасчетПоФормуле,
	|		ЕСТЬNULL(энргВидыУслуг.СоставнаяУслуга, ЛОЖЬ) КАК СоставнаяУслуга,
	|		Вложенныйзапрос.ТипУзлаУчета КАК ТипУзлаУчета,
	|		Вложенныйзапрос.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|		Вложенныйзапрос.ТипПрибораУчета КАК ТипПрибораУчета,
	|		Вложенныйзапрос.ТипИзмерителя КАК ТипИзмерителя
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ДанныеПоПриборам.Организация КАК Организация,
	|			ДанныеПоПриборам.Район КАК Район,
	|			ДанныеПоПриборам.КлючПомещения КАК КлючПомещения,
	|			ДанныеПоПриборам.ТочкаУчета КАК ТочкаУчета,
	|			ДанныеПоПриборам.ПриборУчета КАК ПриборУчета,
	|			ДанныеПоПриборам.Шкала КАК Шкала,
	|			ДанныеПоПриборам.РегистрируетОбъем КАК РегистрируетОбъем,
	|			ДанныеПоПриборам.ТипУзлаУчета КАК ТипУзлаУчета,
	|			ДанныеПоПриборам.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|			ДанныеПоПриборам.ТипПрибораУчета КАК ТипПрибораУчета,
	|			ДанныеПоПриборам.ТипИзмерителя КАК ТипИзмерителя,
	|			ЕСТЬNULL(УслугиДействующихТочек.Услуга, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК Услуга,
	|			ЕСТЬNULL(НаправлениеИспользованияДействующихТочек.НаправлениеИспользованияТУ, ЗНАЧЕНИЕ(Справочник.энргНаправлениеИспользованияТочекУчета.ОсновноеНаправление)) КАК НаправлениеИспользованияТУ,
	|			НЕ ДействующиеТочкиТочкиПоФормуле.ТочкаУчета ЕСТЬ NULL КАК РасчетПоФормуле,
	|			ЕСТЬNULL(ВидДифференцированностиВведенныхПриборов.ВидДифференцированности, ЗНАЧЕНИЕ(Справочник.энргВидыДифференцированности.Однотарифный)) КАК ВидДифференцированности
	|		ИЗ
	|			ДанныеПоПриборам КАК ДанныеПоПриборам
	|				ЛЕВОЕ СОЕДИНЕНИЕ УслугиДействующихТочек КАК УслугиДействующихТочек
	|				ПО ДанныеПоПриборам.Организация = УслугиДействующихТочек.Организация
	|					И ДанныеПоПриборам.Район = УслугиДействующихТочек.Район
	|					И ДанныеПоПриборам.КлючПомещения = УслугиДействующихТочек.КлючПомещения
	|					И ДанныеПоПриборам.ТочкаУчета = УслугиДействующихТочек.ТочкаУчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ НаправлениеИспользованияДействующихТочек КАК НаправлениеИспользованияДействующихТочек
	|				ПО ДанныеПоПриборам.Организация = НаправлениеИспользованияДействующихТочек.Организация
	|					И ДанныеПоПриборам.Район = НаправлениеИспользованияДействующихТочек.Район
	|					И ДанныеПоПриборам.КлючПомещения = НаправлениеИспользованияДействующихТочек.КлючПомещения
	|					И ДанныеПоПриборам.ТочкаУчета = НаправлениеИспользованияДействующихТочек.ТочкаУчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ ДействующиеТочкиТочкиПоФормуле КАК ДействующиеТочкиТочкиПоФормуле
	|				ПО ДанныеПоПриборам.Организация = ДействующиеТочкиТочкиПоФормуле.Организация
	|					И ДанныеПоПриборам.Район = ДействующиеТочкиТочкиПоФормуле.Район
	|					И ДанныеПоПриборам.КлючПомещения = ДействующиеТочкиТочкиПоФормуле.КлючПомещения
	|					И ДанныеПоПриборам.ТочкаУчета = ДействующиеТочкиТочкиПоФормуле.ТочкаУчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВидДифференцированностиВведенныхПриборов КАК ВидДифференцированностиВведенныхПриборов
	|				ПО ДанныеПоПриборам.Организация = ВидДифференцированностиВведенныхПриборов.Организация
	|					И ДанныеПоПриборам.Район = ВидДифференцированностиВведенныхПриборов.Район
	|					И ДанныеПоПриборам.КлючПомещения = ВидДифференцированностиВведенныхПриборов.КлючПомещения
	|					И ДанныеПоПриборам.ПриборУчета = ВидДифференцированностиВведенныхПриборов.ПриборУчета
	|					И ДанныеПоПриборам.Шкала = ВидДифференцированностиВведенныхПриборов.Шкала) КАК Вложенныйзапрос
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|			ПО Вложенныйзапрос.Услуга = энргВидыУслуг.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ АбонентыПомещений КАК АбонентыПомещений
	|			ПО Вложенныйзапрос.Организация = АбонентыПомещений.Организация
	|				И Вложенныйзапрос.Район = АбонентыПомещений.Район
	|				И Вложенныйзапрос.Услуга = АбонентыПомещений.Услуга
	|				И Вложенныйзапрос.КлючПомещения = АбонентыПомещений.КлючПомещения) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыДифференцированности.ТарифныеЗоны КАК энргВидыДифференцированностиТарифныеЗоны
	|		ПО ВложенныйЗапрос.ВидДифференцированности = энргВидыДифференцированностиТарифныеЗоны.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Район,
	|	КлючПомещения,
	|	ВложенныйЗапрос.ТочкаУчета,
	|	ВложенныйЗапрос.Шкала");
	
	Пакет  			= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	Пакет.УстановитьТекстЗапроса(
	"ВЫБРАТЬ
	|	ДействующиеПриборыУчетаПомещения.Организация КАК Организация,
	|	ДействующиеПриборыУчетаПомещения.Район КАК Район,
	|	ДействующиеПриборыУчетаПомещения.КлючПомещения КАК КлючПомещения,
	|	ДействующиеПриборыУчетаПомещения.ТочкаУчета КАК ТочкаУчета,
	|	ТекущийСоставУзла.Измеритель КАК ПриборУчета,
	|	ИСТИНА КАК ВспомогательноеОборудование,
	|	энргПриборыУчетаАбонента.ТипПрибораУчета КАК ТипПрибораУчета,
	|	энргПриборыУчетаАбонента.РасположениеИзмерителя КАК РасположениеИзмерителя,
	|	энргТипыПриборовУчета.Родитель КАК ТипИзмерителя
	|ИЗ
	|	ДействующиеПриборыУчетаПомещения КАК ДействующиеПриборыУчетаПомещения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекущийСоставУзла КАК ТекущийСоставУзла
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргТипыПриборовУчета КАК энргТипыПриборовУчета
	|				ПО энргПриборыУчетаАбонента.ТипПрибораУчета = энргТипыПриборовУчета.Ссылка
	|			ПО ТекущийСоставУзла.Измеритель = энргПриборыУчетаАбонента.Ссылка
	|		ПО ДействующиеПриборыУчетаПомещения.Организация = ТекущийСоставУзла.Организация
	|			И ДействующиеПриборыУчетаПомещения.Район = ТекущийСоставУзла.Район
	|			И ДействующиеПриборыУчетаПомещения.КлючПомещения = ТекущийСоставУзла.КлючПомещения
	|			И ДействующиеПриборыУчетаПомещения.ПриборУчета = ТекущийСоставУзла.ПриборУчета
	|			И (НЕ ДействующиеПриборыУчетаПомещения.ПриборУчета = ТекущийСоставУзла.Измеритель)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Район,
	|	КлючПомещения,
	|	ТочкаУчета");
	

КонецПроцедуры

Процедура ЗаполнитьСхемуЗапросаДействующегоОсновногоОборудованияПомещения(Схема, Параметры) Экспорт
	РегистрыСведений.энргСостояниеПриборовУчетаАбонента.ДействующиеПриборыУчетаПомещения(Схема, Параметры, "ДействующиеПриборыУчетаПомещения");//"ВведенныеПриборыДействующихТочек");
	РегистрыСведений.энргУслугиТочекУчета.УслугиДействующихТочек(Схема, Параметры, "УслугиДействующихТочек");
	РегистрыСведений.энргНаправлениеИспользованияТочекУчета.НаправлениеИспользованияДействующихТочек(Схема, Параметры, "НаправлениеИспользованияДействующихТочек");
	РегистрыСведений.энргПоставщикиУслугАбонента.ПоставщикиУслугДействующихТочек(Схема,Параметры,"ПоставщикиУслугДействующихТочек");
	РегистрыСведений.энргВидыДифференцированностиПриборовУчета.ВидДифференцированностиВведенныхПриборов(Схема, Параметры, "ВидДифференцированностиВведенныхПриборов");
	РегистрыСведений.энргРасчетныеСпособыТочекУчета.ДействующиеТочкиТочкиПоФормуле(Схема, Параметры, "ДействующиеТочкиТочкиПоФормуле"); 
	РегистрыСведений.энргДатыПоверкиПрибораУчета.ДатыПоверокДействующихПриборовУчета(Схема,Параметры,"ДатыПоверкиВведенныхПриборовДействующихТочек");
КонецПроцедуры

Процедура ЗаполнитьСхемуЗапросаДействующегоВспомогательногоОборудованияПомещения(Схема, Параметры) Экспорт
	РегистрыСведений.энргСоставУзлаУчетаПомещения.ТекущийСоставУзла(Схема, Параметры, "ТекущийСоставУзла");
КонецПроцедуры

#КонецОбласти
